SM_для_EDT/src/Documents/vftРапортОПоврежденииНеисправности/vftРапортОПоврежденииНеисправности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>vftРапортОПоврежденииНеисправности</name>
  <basedOn>Document.впВыявленныеДефекты</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Статус2</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Механизм_Система</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСерийногоНомера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКапитана</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Механик</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОдобреноКолВоПозиций</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказаноКуда</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйПоНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКапитанаПоНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыполнено</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветКомпании</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРассмотрения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументаРапортОПовреждении</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияДефекта</name>
    <type>
      <types>DocumentRef.впВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректирующиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредупреждающиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриобретениеЗИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаСнабжение</name>
    <type>
      <types>DocumentRef.впЗаявкаНаСнабжение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТребуемыеДействия</name>
    <attributes>
      <name>НеобходимыеСЗЧ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимыеРаботы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КаталожныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявкиТС3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаявкиТС3</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НеобходимыеРемонтыеРаботы</name>
    <attributes>
      <name>НеобходимыеРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОписаниеНеисправностей</name>
    <attributes>
      <name>ОписаниеНеисправности</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Enums/vftСтатусыДокументаРапортОПовреждении/vftСтатусыДокументаРапортОПовреждении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>vftСтатусыДокументаРапортОПовреждении</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Рассмотрен</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/vftРапортОПоврежденииНеисправности/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура Настройки(Команда)
	
	ИнвертироватьПанельНастройки();
	УстановитьВидимостьПанелиНастроек();
	
КонецПроцедуры

&НаКлиенте 
Процедура ИнвертироватьПанельНастройки()
	
	ПанельНастроек = НЕ ПанельНастроек;
	Элементы.КнопкаНастройки.Пометка = ПанельНастроек;
	
КонецПроцедуры

&НаКлиенте 
Процедура УстановитьВидимостьПанелиНастроек()
	
	Элементы.ГруппаНастройки.Видимость = ПанельНастроек;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПанельНастроек = ЛОЖЬ;
	УстановитьВидимостьПанелиНастроек();
	//rarus_rasuli_30.03.18 ++
	ЕслиСтатусПустой();
	//rarus_rasuli_30.03.18 --	
	vftОбщиеПроцедурыДокументовКлиент.УстановитьУсловноеОформлениеРапорт(Список);
	vftОбщиеПроцедурыДокументовКлиент.УстановитьПараметрГруппаСудов(Список,ОтборГруппаСудов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборГруппаСудовПриИзменении(Элемент)
	vftОбщиеПроцедурыДокументовКлиент.УстановитьПараметрГруппаСудов(Список,ОтборГруппаСудов);
КонецПроцедуры

&НаКлиенте
Процедура ОтборГруппаСудовОчистка(Элемент, СтандартнаяОбработка)
	vftОбщиеПроцедурыДокументовКлиент.УстановитьПараметрГруппаСудов(Список,ОтборГруппаСудов);
КонецПроцедуры

//rarus_rasuli_30.03.18 ++
&НаСервере
Функция ЕслиСтатусПустой()
	Выборка = Документы.vftРапортОПоврежденииНеисправности.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		Если не ЗначениеЗаполнено(Выборка.Статус) Тогда
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Если  ЗначениеЗаполнено(Объект.Статус2) Тогда
				Объект.Статус = Объект.Статус2;
			Иначе
				Объект.Статус = Перечисления.vftСтатусыДокументаРапортОПовреждении.Черновик;
			КонецЕсли;
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

//rarus_rasuli_30.03.18 --

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ++ rarus ilshill 12.02.2021
			
	Если ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ") Тогда
		
		ЭтаФорма.АвтоЗаголовок = Ложь;	
		ЭтаФорма.Заголовок = "Рапорт о техническом недостатке";
		
	КонецЕсли;
	// -- rarus ilshill 12.02.2021

КонецПроцедуры
